Repository: Coernel82/SEPA-QR-for-Woocommerce
Catalog: wp-plugins-mxp-sepa-qr-code-addon-for-woocommerce-stable-readme-*.po
Languages: de

source: Adds a SEPA-QR Code for bank transfer payments (bacs) in the WooCommerce Thankyou page and Woocommerce emails. The QR-Code can be hooked into other pl &hellip;
de: Fügt einen SEPA-QR-Code für Überweisungen (bacs) zur WooCommer Thankyou-Seite und den WooCommerce Emails zu. Das Plugin kann per Hook den QR-Code in anderen Plugins anzeigen.

source: SEPA QR-Code for Woocommerce (GDPR-compliant)
de: SEPA QR-Code für WooCommerce (DSGVO-konform)

source: The program has been written by a professional programmer - however fully free of charge and without detailed knowledge about WooCommerce. I try to assist you in the support forum or on GitHub the best I can but my knowledge is limited.
de: Das Programm wurde von einem professionellen Programmierer geschrieben, jedoch komplett ehrenamtlich und ohne detailliertes Wissen über WooCommerce. Ich versuche im Supportforum oder bei GitHub so gut es geht Hilfestellung zu leisten, jedoch ist mein Wissen limitiert.

source: Adds a SEPA-QR Code for bank transfer payments (bacs) in the WooCommerce Thankyou page and Woocommerce emails. The QR-Code can be hooked into other plugins.
de: Fügt einen SEPA-QR-Code für Überweisungen (bacs) zur WooCommerce-Danke-Seite und zu den WooCommerce-Emails hinzu. Der QR-Code kann per Hook in anderen Plugins genutzt werden.

source: This surely is due to the fact that some email clients won't show Base64-encoded images. Your help is appreciated! Have a look at https://github.com/Coernel82/SEPA-QR-for-Woocommerce/issues/17 Workaround: Hook it into your PDF-invoices! (see above!)
de: Dieses liegt daran, dass einige Emailprogramme keine Base64-kodierten Bilder anzeigen. Deine Hilfe wird hoch geschätztz! Schaue dir https://github.com/Coernel82/SEPA-QR-for-Woocommerce/issues/17 an. Workaround: Füge den QR-Code per Hook in PDF-Rechnungen ein! (siehe oben!)

source: the prefix mxp is used throghout the plugin to avoid collisions with other plugins and functions. mxp stands for www.musicalexperten.de (musical experts). Remember where you've seen it first! ;-)
de: Die Vorsilbe muxp wird im gesamten Plugin genutzt um Kollisionen mit anderen Plugins und Funktionen zu vermeiden. muxp steht für www.musicalexperten.de. Also: Vergiss nicht, wo du es zuerst gesehen hast! ;-)

source: plugin registers a get-parameter (configurable, default mxp_qr) for testing purposes and, if desired, to create links to the cached QR codes.
de: Das Plugin registriert einen get-paramter (konfigurarierbar, default mupx_qr) für Testzwecke und erstellt links zu gechachten QR-Codes, wenn gewünscht.

source: the QR code generator is from <a href="https://github.com/fellwell5/bezahlcode/">fellwell15</a>
de: Der QR-Code-Generator stammt von <a href="https://github.com/fellwell5/bezahlcode/">fellwell15</a>

source: the QR code generator creates the QR-code locally. There is <strong>no Google-API nor external server in use</strong>!
de: der QR-Code-Generator erstellt die QR-Codes lokal auf dem Server. Es wird <strong>keine Google-API oder sonstiger externer Server genutzt</strong>!

source: Full integration in Woocommerce
de: Komplette integration in WooCommerce

source: Remarks
de: Kommentare

source: Testing and troubleshooting
de: Testen &amp; Fehlerbehebung

source: Hooking into other plugins
de: Hook für andere Plugins

source: What happens in the backend:
de: Was im Hintergrund (Backend) passiert:

source: Prerequisite
de: Voraussetzung

source: Before you start
de: Bevor es losgeht

source: The plugin creates the QR-Code on your server and it does not use any external resources.
de: Das Plugin erstellt QR-Codes auf deinem Server und nutzt dazu keine externen Ressourcen.

source: What about privacy / GDPR
de: Was ist mit Datenschutz / DSGVO?

source: I can't see the QR-Code in a specific email client
de: Ich kann den QR-Code in einem bestimmten Emailprogramm nicht sehen

source: I am more then happy if someone integrates the code into the Woocommerce core! The topic is discussed here: https://github.com/woocommerce/woocommerce/issues/27661
de: Ich bin mehr als glücklich, wenn jemand den Programmcode in den Kern von WooCommerce integriert. Das Thema wird hier diskutiert: https://github.com/woocommerce/woocommerce/issues/27661

source: Storing the QR code in cache or transients is only needed if you want to use a link instead of a picture inside the email. Details in the program code.
de: Den QR-Code im Cache oder in transients zu speichern ist nur nötig, wenn ein Link an Stelle eines Bildes in den Emails genutzt werden soll. Details im Programmcode.

source: www.yourwebpage.de/?mxp_qr=351436ef4b279e1811a6c68a2dd58b1b results in a sad smiley. <a href="https://www.musicalexperten.de/?mxp_qr=351436ef4b279e1811a6c68a2dd58b1b">Working example</a>
de: www.yourwebpage.de/?mxp_qr=351436ef4b279e1811a6c68a2dd58b1b zeigt ein trauriges Smiley an. <a href="https://www.musicalexperten.de/?mxp_qr=351436ef4b279e1811a6c68a2dd58b1b">Funktionierendes Beispiel</a>

source: www.yourwebpage.de/?mxp_qr=something = creates a real QR with dummyvalues 11-11 <a href="https://www.musicalexperten.de/?mxp_qr=something">Working example</a>
de: www.yourwebpage.de/?mxp_qr=something = erstellt einen QR-Code mit den Dummywerten 11-11 <a href="https://www.musicalexperten.de/?mxp_qr=something">Funktionierendes Beispiel</a>

source: Install the plugin and order s.th. in your shop using BACS (direct bank transfer).
de: Installiere das Plugin und bestelle etwas in deinem Shop mit BACS (Überweisung) als Zahlungsmittel.

source: I use a plugin for <a href="https://docs.wpovernight.com/home/woocommerce-pdf-invoices-packing-slips/pdf-template-action-hooks/">PDF-invoices and packaging slips</a>. Refer to this sample to hook the QR-Code into whatever you like:
de: Ich nutze ein Plugin für <a href="https://docs.wpovernight.com/home/woocommerce-pdf-invoices-packing-slips/pdf-template-action-hooks/">PDF-Rechnungen und Lieferscheine</a>. Halte dich an dieses Beispiel um den QR-Code in Wasauchimmer anzuzueigen:

source: Nothing special: * Click install and activate
de: * Auf Installieren klicken und aktivieren

source: php GD2 extension must be installed as the QR-Code generator by <a href="https://github.com/fellwell5/bezahlcode/">fellwell15</a> requires this.
de: Die php GD2 Erweiterung muss installiert werden, da der QR-Code-Generator von <a href="https://github.com/fellwell5/bezahlcode/">fellwell15</a> dieses benötigt.

source: The plugin comes as is and free. However a real person has put real work into it. So if you use it please do s.th. good. Use your efforts, your time for beneficial projects or whatever!
de: Das Plugin kommt so wie es ist ohne Garantie und kostenlos. Jedoch hat eine echte Person echte Arbeit hineingesteckt. Wenn du es also nutzt mache im Gegenzug etwas Gutes. Nutze deine Mühen für Benefizprojekte oder was auch immer!

source: To find an existing cached QR-Code, query for a valid md5 string == If it does not exist in cache or transients, a sad smiley will appear.
de: Um einen existiereneden, gechachten QR-Code zu finden, suche einen gültigen md5 string. Wenn dieser nicht im Cache oder den transients existiert, erscheint ein trauriger Smiley.

source: To test if the QR-Code generator is working
de: Um zu testen, ob der QR-Code generator funktioniert

source: Simple way
de: Der einfache Weg

source: example how the qr-code is hooked into a pdf envoice
de: Beispiel, wie der QR-Code per Hook in einer PDF-Rechnung erscheint

source: the QR-Code gets added to the WooCommerce order email
de: der QR-Code wird zur WooCommerce Bestellbestätigungsemail hinzugefügt

source: added prefix muxp to the bacs-qrcode css class for the QR code. If you have used .bacs-qrcode you have to change it to muxp-bacs-qrcode
de: muxp-Vorsilbe zur bacs-qrcode CSS-Klasse für den QR-Code hinzugefügt. Wenn du .bacs-qrcode genutzt hast, musst du die KLasse zu muxp-bacs-qrcode ändern.

source: added loacalization
de: Übersetzung hinzugefügt

source: initial commit to the wordpress directory
de: Erstveröffentlichung im WordPress-Verzeichnis
